documents/images/graphio/bxdf/standard_surface_to_UsdPreviewSurface_instance.dot
digraph {
  rankdir = LR;
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor ->     NG_standard_surface_to_UsdPreviewSurface_diffuseColor_out;
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor_out [label= "diffuseColor_out"];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor ->     NG_standard_surface_to_UsdPreviewSurface_diffuseColor [label= "in1"];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_base_colorINT [label="base_color"];
    NG_standard_surface_to_UsdPreviewSurface_base_colorINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor [label="multiply"];
    NG_standard_surface_to_UsdPreviewSurface_base_colorINT -> NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor [label=".in1"];
    NG_standard_surface_to_UsdPreviewSurface_baseINT [label="base"];
    NG_standard_surface_to_UsdPreviewSurface_baseINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor [label="multiply"];
    NG_standard_surface_to_UsdPreviewSurface_baseINT -> NG_standard_surface_to_UsdPreviewSurface_scaledBaseColor [label=".in2"];
    NG_standard_surface_to_UsdPreviewSurface_coatAttenuation [label= "mix"];
    NG_standard_surface_to_UsdPreviewSurface_coatAttenuation[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_coatAttenuation ->     NG_standard_surface_to_UsdPreviewSurface_diffuseColor [label= "in2"];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_diffuseColor[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_coat_colorINT [label="coat_color"];
    NG_standard_surface_to_UsdPreviewSurface_coat_colorINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_coatAttenuation [label="mix"];
    NG_standard_surface_to_UsdPreviewSurface_coat_colorINT -> NG_standard_surface_to_UsdPreviewSurface_coatAttenuation [label=".fg"];
    NG_standard_surface_to_UsdPreviewSurface_coatINT [label="coat"];
    NG_standard_surface_to_UsdPreviewSurface_coatINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_coatAttenuation [label="mix"];
    NG_standard_surface_to_UsdPreviewSurface_coatINT -> NG_standard_surface_to_UsdPreviewSurface_coatAttenuation [label=".mix"];
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor ->     NG_standard_surface_to_UsdPreviewSurface_emissiveColor_out;
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor_out [label= "emissiveColor_out"];
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_emission_colorINT [label="emission_color"];
    NG_standard_surface_to_UsdPreviewSurface_emission_colorINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor [label="multiply"];
    NG_standard_surface_to_UsdPreviewSurface_emission_colorINT -> NG_standard_surface_to_UsdPreviewSurface_emissiveColor [label=".in1"];
    NG_standard_surface_to_UsdPreviewSurface_emissionINT [label="emission"];
    NG_standard_surface_to_UsdPreviewSurface_emissionINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_emissiveColor [label="multiply"];
    NG_standard_surface_to_UsdPreviewSurface_emissionINT -> NG_standard_surface_to_UsdPreviewSurface_emissiveColor [label=".in2"];
    NG_standard_surface_to_UsdPreviewSurface_metallic [label= "dot"];
    NG_standard_surface_to_UsdPreviewSurface_metallic[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_metallic ->     NG_standard_surface_to_UsdPreviewSurface_metallic_out;
    NG_standard_surface_to_UsdPreviewSurface_metallic_out [label= "metallic_out"];
    NG_standard_surface_to_UsdPreviewSurface_metallic_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_metalnessINT [label="metalness"];
    NG_standard_surface_to_UsdPreviewSurface_metalnessINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_metallic [label="dot"];
    NG_standard_surface_to_UsdPreviewSurface_metalnessINT -> NG_standard_surface_to_UsdPreviewSurface_metallic [label=".in"];
    NG_standard_surface_to_UsdPreviewSurface_roughness [label= "dot"];
    NG_standard_surface_to_UsdPreviewSurface_roughness[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_roughness ->     NG_standard_surface_to_UsdPreviewSurface_roughness_out;
    NG_standard_surface_to_UsdPreviewSurface_roughness_out [label= "roughness_out"];
    NG_standard_surface_to_UsdPreviewSurface_roughness_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_specular_roughnessINT [label="specular_roughness"];
    NG_standard_surface_to_UsdPreviewSurface_specular_roughnessINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_roughness [label="dot"];
    NG_standard_surface_to_UsdPreviewSurface_specular_roughnessINT -> NG_standard_surface_to_UsdPreviewSurface_roughness [label=".in"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat [label= "dotproduct"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat ->     NG_standard_surface_to_UsdPreviewSurface_clearcoat_out;
    NG_standard_surface_to_UsdPreviewSurface_clearcoat_out [label= "clearcoat_out"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_coatColor [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_coatColor[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_coatColor ->     NG_standard_surface_to_UsdPreviewSurface_clearcoat [label= "in1"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat [label= "dotproduct"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_coat_colorINT [label="coat_color"];
    NG_standard_surface_to_UsdPreviewSurface_coat_colorINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_coatColor [label="multiply"];
    NG_standard_surface_to_UsdPreviewSurface_coat_colorINT -> NG_standard_surface_to_UsdPreviewSurface_coatColor [label=".in1"];
    NG_standard_surface_to_UsdPreviewSurface_coatINT [label="coat"];
    NG_standard_surface_to_UsdPreviewSurface_coatINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_coatColor [label="multiply"];
    NG_standard_surface_to_UsdPreviewSurface_coatINT -> NG_standard_surface_to_UsdPreviewSurface_coatColor [label=".in2"];
    NG_standard_surface_to_UsdPreviewSurface_constantOneThird [label= "divide"];
    NG_standard_surface_to_UsdPreviewSurface_constantOneThird[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_constantOneThird ->     NG_standard_surface_to_UsdPreviewSurface_clearcoat [label= "in2"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat [label= "dotproduct"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoat[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness [label= "dot"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness ->     NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness_out;
    NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness_out [label= "clearcoatRoughness_out"];
    NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_coat_roughnessINT [label="coat_roughness"];
    NG_standard_surface_to_UsdPreviewSurface_coat_roughnessINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness [label="dot"];
    NG_standard_surface_to_UsdPreviewSurface_coat_roughnessINT -> NG_standard_surface_to_UsdPreviewSurface_clearcoatRoughness [label=".in"];
    NG_standard_surface_to_UsdPreviewSurface_opacity [label= "dotproduct"];
    NG_standard_surface_to_UsdPreviewSurface_opacity[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_opacity ->     NG_standard_surface_to_UsdPreviewSurface_opacity_out;
    NG_standard_surface_to_UsdPreviewSurface_opacity_out [label= "opacity_out"];
    NG_standard_surface_to_UsdPreviewSurface_opacity_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_opacityINT [label="opacity"];
    NG_standard_surface_to_UsdPreviewSurface_opacityINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_opacity [label="dotproduct"];
    NG_standard_surface_to_UsdPreviewSurface_opacityINT -> NG_standard_surface_to_UsdPreviewSurface_opacity [label=".in1"];
    NG_standard_surface_to_UsdPreviewSurface_constantOneThird [label= "divide"];
    NG_standard_surface_to_UsdPreviewSurface_constantOneThird[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_constantOneThird ->     NG_standard_surface_to_UsdPreviewSurface_opacity [label= "in2"];
    NG_standard_surface_to_UsdPreviewSurface_opacity [label= "dotproduct"];
    NG_standard_surface_to_UsdPreviewSurface_opacity[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_ior [label= "dot"];
    NG_standard_surface_to_UsdPreviewSurface_ior[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_ior ->     NG_standard_surface_to_UsdPreviewSurface_ior_out;
    NG_standard_surface_to_UsdPreviewSurface_ior_out [label= "ior_out"];
    NG_standard_surface_to_UsdPreviewSurface_ior_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_specular_IORINT [label="specular_IOR"];
    NG_standard_surface_to_UsdPreviewSurface_specular_IORINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_ior [label="dot"];
    NG_standard_surface_to_UsdPreviewSurface_specular_IORINT -> NG_standard_surface_to_UsdPreviewSurface_ior [label=".in"];
    NG_standard_surface_to_UsdPreviewSurface_normal [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_normal[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_normal ->     NG_standard_surface_to_UsdPreviewSurface_normal_out;
    NG_standard_surface_to_UsdPreviewSurface_normal_out [label= "normal_out"];
    NG_standard_surface_to_UsdPreviewSurface_normal_out[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_biasNormal [label= "subtract"];
    NG_standard_surface_to_UsdPreviewSurface_biasNormal[shape = box];
    NG_standard_surface_to_UsdPreviewSurface_biasNormal ->     NG_standard_surface_to_UsdPreviewSurface_normal [label= "in1"];
    NG_standard_surface_to_UsdPreviewSurface_normal [label= "multiply"];
    NG_standard_surface_to_UsdPreviewSurface_normal[shape = box]; 
    NG_standard_surface_to_UsdPreviewSurface_normalINT [label="normal"];
    NG_standard_surface_to_UsdPreviewSurface_normalINT [shape = ellipse];
    NG_standard_surface_to_UsdPreviewSurface_biasNormal [label="subtract"];
    NG_standard_surface_to_UsdPreviewSurface_normalINT -> NG_standard_surface_to_UsdPreviewSurface_biasNormal [label=".in1"];
}
